ttrftech/LPC4370SDR-FM/src/main.c
struct {
	uint32_t last;
} fm_demod_state;

void fm_demod()
{
	uint32_t *src = (uint32_t *)DEMOD_BUFFER;
	int16_t *dest = (int16_t *)RESAMPLE_BUFFER;
	int32_t length = DEMOD_BUFFER_SIZE / sizeof(uint32_t);
	int i;

	uint32_t x0 = fm_demod_state.last;
	for (i = 0; i < length; i++) {
		uint32_t x1 = src[i];
		int32_t d = __SMUSDX(__SSUB16(x1, x0), x1);
		int32_t n = __SMUAD(x1, x1) >> 10;
		int16_t y = d / n;
		dest[i] = y;
		x0 = x1;
	}
	fm_demod_state.last = x0;
}

#define RESAMPLE_NUM_TAPS	128

q15_t resample_fir_coeff_even[RESAMPLE_NUM_TAPS] = {
		   0,    0,    1,    2,    3,    4,    6,    7,    9,   11,   12,
		         14,   15,   17,   18,   18,   18,   17,   15,   13,    9,    4,
		         -1,   -7,  -15,  -24,  -33,  -43,  -53,  -63,  -73,  -82,  -90,
		        -96, -100, -102, -101,  -97,  -89,  -78,  -62,  -42,  -18,    9,
		         42,   79,  120,  163,  210,  259,  310,  362,  414,  465,  515,
		        563,  608,  649,  686,  717,  743,  763,  777,  784,  784,  777,
		        763,  743,  717,  686,  649,  608,  563,  515,  465,  414,  362,
		        310,  259,  210,  163,  120,   79,   42,    9,  -18,  -42,  -62,
		        -78,  -89,  -97, -101, -102, -100,  -96,  -90,  -82,  -73,  -63,
		        -53,  -43,  -33,  -24,  -15,   -7,   -1,    4,    9,   13,   15,
		         17,   18,   18,   18,   17,   15,   14,   12,   11,    9,    7,
		          6,    4,    3,    2,    1,    0,    0};
q15_t resample_fir_coeff_odd[RESAMPLE_NUM_TAPS] = {
		   0,    0,    1,    2,    4,    5,    6,    8,   10,   12,   13,
		         15,   16,   17,   18,   18,   17,   16,   14,   11,    7,    1,
		         -4,  -11,  -19,  -28,  -38,  -48,  -58,  -68,  -77,  -86,  -93,
		        -98, -101, -102, -100,  -94,  -84,  -70,  -53,  -31,   -4,   25,
		         60,   99,  141,  187,  235,  285,  336,  388,  440,  490,  539,
		        586,  629,  668,  702,  731,  754,  771,  781,  784,  781,  771,
		        754,  731,  702,  668,  629,  586,  539,  490,  440,  388,  336,
		        285,  235,  187,  141,   99,   60,   25,   -4,  -31,  -53,  -70,
		        -84,  -94, -100, -102, -101,  -98,  -93,  -86,  -77,  -68,  -58,
		        -48,  -38,  -28,  -19,  -11,   -4,    1,    7,   11,   14,   16,
		         17,   18,   18,   17,   16,   15,   13,   12,   10,    8,    6,
		          5,    4,    2,    1,    0,    0,    0};

// 312.5kHz * 2/13 -> 48.076923kHz

struct {
	int index;
	float deemphasis_mult;
	float deemphasis_rest;
	float deemphasis_value;
} resample_state;

struct {
	int write_current;
	int write_total;
	int read_total;
	int read_current;
	int rebuffer_count;
} audio_state;

void
deemphasis_init(int timeconst_us)
{
	resample_state.deemphasis_value = 0;
	resample_state.deemphasis_mult = exp(-1e6/(timeconst_us * AUDIO_SAMPLE_RATE));
	resample_state.deemphasis_rest = 1 - resample_state.deemphasis_mult;
}

void resample_fir_filter2()
{
	const uint32_t *coeff;
	const uint16_t *src = (const uint16_t *)RESAMPLE_STATE;
	const uint32_t *s;
	int32_t tail = RESAMPLE_BUFFER_SIZE;
	int idx = resample_state.index;
	int32_t acc;
	int i, j;
	int cur = audio_state.write_current;
	uint16_t *dest = (uint16_t *)AUDIO_BUFFER;
	float value = resample_state.deemphasis_value;

	while (idx < tail) {
		if (idx & 0x1)
			coeff = (uint32_t*)resample_fir_coeff_odd;
		else
			coeff = (uint32_t*)resample_fir_coeff_even;

		acc = 0;
		s = (const uint32_t*)&src[idx >> 1];
		for (j = 0; j < RESAMPLE_NUM_TAPS / 2; j++) {
			acc = __SMLAD(*s++, *coeff++, acc);
		}

		value = (float)acc * resample_state.deemphasis_rest + value * resample_state.deemphasis_mult;
		dest[cur++] = __SSAT(((int32_t)value >> 12), 16);
		cur %= AUDIO_BUFFER_SIZE / 2;
		audio_state.write_total++;
		//dest[cur++] = __PKHBT(__SSAT((acc0 >> 15), 16), __SSAT((acc1 >> 15), 16), 16);
		idx += 13;
	}

#define THRESHOLD (7 * (AUDIO_BUFFER_SIZE/2) / 8)
#define WR_GAP (1 * (AUDIO_BUFFER_SIZE/2) / 8)
	int d = audio_state.write_current - audio_state.read_current;
	d %= AUDIO_BUFFER_SIZE / 2;
	if (d > THRESHOLD) {
		audio_state.read_current = (audio_state.write_current - WR_GAP) % (AUDIO_BUFFER_SIZE / 2);
		audio_state.rebuffer_count++;
	}
	resample_state.deemphasis_value = value;
	audio_state.write_current = cur;
	resample_state.index = idx - tail;
	uint32_t *state = (uint32_t *)RESAMPLE_STATE;
	src = &src[tail / sizeof(*src)];
	for (i = 0; i < RESAMPLE_STATE_SIZE / sizeof(uint32_t); i++) {
		//*state++ = *src++;
	    __asm__ volatile ("ldr r0, [%0], #+4\n" : : "r" (src) : "r0");
	    __asm__ volatile ("str r0, [%0], #+4\n" : : "r" (state));
	}
}
#if 0
void resample_fir_filter()
{
	const uint32_t *coeff;
	const uint32_t *src = (const uint32_t *)RESAMPLE_STATE;
	int32_t tail = RESAMPLE_BUFFER_SIZE;
	int idx = resample_state.index;
	uint32_t acc;
	uint32_t x0, c0, x1, x2;
	int i, j;
	int cur = resample_state.current;
	uint16_t *dest = (uint16_t *)AUDIO_BUFFER;

	while (idx < tail) {
		int cls = idx & 0x3;
		i = idx >> 2;

		switch (cls) {
		case 0:
		case 2:
			coeff = (uint32_t*)resample_fir_coeff_even;
			break;
		case 1:
		case 3:
			coeff = (uint32_t*)resample_fir_coeff_odd;
			break;
		}

		acc = 0;
		switch (cls) {
		case 0:
		case 1:
			for (j = 0; j < RESAMPLE_NUM_TAPS / 2; ) {
				x0 = src[i+j];
				c0 = coeff[j++];
				acc = __SMLAD(x0, c0, acc);
			}
			break;
		case 2:
		case 3:
			x0 = src[i];
			for (j = 0; j < RESAMPLE_NUM_TAPS / 2; ) {
				c0 = coeff[j++];
				x2 = src[i+j];
				x1 = __PKHBT(x2, x0, 0);
				acc = __SMLADX(x1, c0, acc);
				x0 = x2;
			}
			break;
		}
		dest[cur++] = __SSAT((acc >> 15), 16);
		cur %= AUDIO_BUFFER_SIZE / 2;
		//dest[cur++] = __PKHBT(__SSAT((acc0 >> 15), 16), __SSAT((acc1 >> 15), 16), 16);
		idx += 13;
	}

	resample_state.current = cur;
	resample_state.index = idx - tail;
	uint32_t *state = (uint32_t *)RESAMPLE_STATE;
	src = &src[tail / sizeof(*src)];
	for (i = 0; i < RESAMPLE_STATE_SIZE / sizeof(uint32_t); i++) {
		//*state++ = *src++;
	    __asm__ volatile ("ldr r0, [%0], #+4\n" : : "r" (src) : "r0");
	    __asm__ volatile ("str r0, [%0], #+4\n" : : "r" (state));
	}
}
#endif

void DMA_IRQHandler (void)
{
  if (LPC_GPDMA->INTERRSTAT & 1)
  {
    LPC_GPDMA->INTERRCLR = 1;
  }

//#define MEMCPY __aeabi_memcpy8

