ttrftech/LPC4370SDR-FM/src/main.c
    VADC_Stop();

    printf("Hello World\n");
    GPIO_SetDir(0,1<<8, 1);
	GPIO_ClearValue(0,1<<8);

	scu_pinmux(0x6, 11, SETTINGS_GPIO_OUT, FUNC0); //GPIO3[7], available on J7-14
	LPC_GPIO_PORT->DIR[3] |= (1UL << 7);
	LPC_GPIO_PORT->SET[3] |= (1UL << 7);

	//ConfigureNCOTable(0); // 0MHz
	//ConfigureNCOTable(420000 / 5000); // 400kHz
	//ConfigureNCOTable(420000 / 10000); // 400kHz

	//ConfigureNCOTable(400000 / 9500); // 400kHz
	//ConfigureNCOTable(400 * 1024 / 10000); // 400kHz
	ConfigureNCOTable(2500000 / 9700); // 2.5MHz
	memset(&cic_i, 0, sizeof cic_i);
	memset(&cic_q, 0, sizeof cic_q);
	//arm_fir_init_q15(&fir, FIR_NUM_TAPS, fir_coeff, fir_state, FIR_BLOCK_SIZE);
	deemphasis_init(75);

	ConfigureTLV320(48000);

	VADC_Init();

	/* wait 5 msec */
	emc_WaitUS(5000);

	capture_count = 0;
	VADC_Start();
    //volatile static int i = 0 ;

	int i;
	int16_t *buf = (int16_t*)AUDIO_BUFFER2;
	for (i = 0; i < 0x1000; i++) {
		float res = arm_sin_f32((float)i * 2 * PI * 13000 / 48000);
		buf[i] = (int)(res * 20000.0);
	}

    while(1) {
        //i++ ;
        if ((capture_count % 2048) == 2047) {
        	//int i;
//        	LPC_GPDMA->C0CONFIG |= (1 << 18); //halt further requests
            //printf("write:%d read:%d\n", audio_state.write_total, audio_state.read_total);
            //printf("diff:%d\n", audio_state.write_total - audio_state.read_total);
            //printf("rebuf:%d\n", audio_state.rebuffer_count);
//        	GPIO_SetValue(0,1<<8);

        	//int length = CAPTUREBUFFER_SIZE / 2;
        	//memset(DEST_BUFFER, 0, DEST_BUFFER_SIZE);
            //cic_decimate(&cic1, CAPTUREBUFFER, length);

        	//GPIO_SetValue(0,1<<8);
        	//SET_MEAS_PIN_3();
        	//fir_filter_iq();
        	//fm_demod();
//        	resample_fir_filter2();
#if 0
    		q15_t *src = I_DEST_BUFFER;
    		q15_t *dst = I_FIR_BUFFER;
        	for (i = 0; i < FIR_NUM_BLOCKS; i++) {
        		arm_fir_fast_q15(&fir, src, dst, FIR_BLOCK_SIZE);
        		src += FIR_BLOCK_SIZE;
        		dst += FIR_BLOCK_SIZE;
        	}
#endif
        	//CLR_MEAS_PIN_3();
        } else if ((capture_count % 2048) < 1024) {
        	GPIO_SetValue(0,1<<8);
    	} else
        	GPIO_ClearValue(0,1<<8);
        //if ((i & 0x1fffff) == 0x100000)
        //	printf("%d\n", i);
#if 0
        {
        	uint32_t txLevel = I2S_GetLevel(LPC_I2S0, I2S_TX_MODE);
        	int rest = audio_state.write_total - audio_state.read_total;
        	if (txLevel <= 4) {
        		// Fill the remaining FIFO
        		int cur = audio_state.read_current;
        		int16_t *buffer = (int16_t*)AUDIO_BUFFER2;
        		//int16_t *buffer = (int16_t*)AUDIO_BUFFER;
        		int i;
        		for (i = 0; i < (8 - txLevel); i++) {
        			LPC_I2S0->TXFIFO = *(uint32_t *)&buffer[cur];
        			cur += 2;
        			cur %= AUDIO_BUFFER_SIZE / 2;
        			audio_state.read_total += 2;
        		}
        		audio_state.read_current = cur;
            }
        }
#endif
    }
	VADC_Stop();
    return 0 ;
}
